//DAY1     JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),NOTIFY=&SYSUID,
//           REGION=0M
//JCL  JCLLIB  ORDER=IGY.V6R4M0.SIGYPROC                   
//STEP1        EXEC PROC=IGYWCLG                                
//COBOL.SYSIN   DD DSN=AOC5AP.COBOL(DAY1),DISP=SHR
//GO.INPUTF     DD DSN=AOC5AP.INPUT(DAY1),DISP=SHR  
/*
